# Electrical Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisciplineTypeId..::..Electrical Property
DisciplineTypeId Class See Also
---
Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static ForgeTypeId Electrical { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Electrical As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Electrical {
	ForgeTypeId^ get ();
}
```

# See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace